; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v3)
		(pred_3 ?v7)
		(pred_5 ?v8)
		(pred_2 ?v8)
		(pred_1 ?v7 ?v8)
		(pred_4)
		(pred_6 ?v7))

   (:action op_1
       :parameters  (?v6 ?v2)
       :precondition (and (not-eq ?v6 ?v2) 
                          (pred_5 ?v6) (pred_5 ?v2) (pred_2 ?v6))
       :effect (and  (pred_2 ?v2)
		     (not (pred_2 ?v6))))


   (:action op_3
       :parameters (?v5 ?v1)
       :precondition  (and  (pred_3 ?v5) (pred_5 ?v1)
			    (pred_1 ?v5 ?v1) (pred_2 ?v1) (pred_4))
       :effect (and (pred_6 ?v5)
		    (not (pred_1 ?v5 ?v1)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v5  ?v1)
       :precondition  (and  (pred_3 ?v5) (pred_5 ?v1)
			    (pred_6 ?v5) (pred_2 ?v1))
       :effect (and (pred_1 ?v5 ?v1)
		    (pred_4)
		    (not (pred_6 ?v5)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_06 obj_05 obj_07 obj_04 obj_08 
          obj_02 obj_01 obj_03 
)
(:init
(pred_5 obj_06)
(pred_5 obj_05)
(pred_5 obj_07)
(pred_5 obj_04)
(pred_5 obj_08)
(pred_3 obj_02)
(pred_3 obj_01)
(pred_3 obj_03)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(pred_4)
(pred_1 obj_02 obj_06)
(pred_1 obj_01 obj_05)
(pred_1 obj_03 obj_06)
(pred_2 obj_07)
)
(:goal
(and
(pred_1 obj_02 obj_05)
(pred_1 obj_01 obj_04)
(pred_1 obj_03 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_02 obj_05) (pred_2 obj_04))
    (sometime-before  (pred_1 obj_01 obj_04) (pred_2 obj_06))
    (sometime-before  (pred_1 obj_03 obj_04) (pred_2 obj_05))
  )
)
)

; plan
1. (op_1 obj_07 obj_04)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_04)
   goals met: 0 of 3
2. (op_1 obj_04 obj_05)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_05)
   goals met: 0 of 3
3. (op_3 obj_01 obj_05)
   deleted: (pred_1 obj_01 obj_05) (pred_4)
   added: (pred_6 obj_01)
   goals met: 0 of 3
4. (op_1 obj_05 obj_04)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_04)
   goals met: 0 of 3
5. (op_1 obj_04 obj_06)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_06)
   goals met: 0 of 3
6. (op_2 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_1 obj_01 obj_06) (pred_4)
   goals met: 0 of 3
7. (op_3 obj_03 obj_06)
   deleted: (pred_1 obj_03 obj_06) (pred_4)
   added: (pred_6 obj_03)
   goals met: 0 of 3
8. (op_1 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_04)
   goals met: 0 of 3
9. (op_2 obj_03 obj_04)
   deleted: (pred_6 obj_03)
   added: (pred_1 obj_03 obj_04) (pred_4)
   goals met: 1 of 3
10. (op_1 obj_04 obj_06)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_06)
   goals met: 1 of 3
11. (op_3 obj_01 obj_06)
   deleted: (pred_1 obj_01 obj_06) (pred_4)
   added: (pred_6 obj_01)
   goals met: 1 of 3
12. (op_1 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_04)
   goals met: 1 of 3
13. (op_2 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_1 obj_01 obj_04) (pred_4)
   goals met: 2 of 3
14. (op_1 obj_04 obj_05)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_05)
   goals met: 2 of 3
15. (op_1 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 2 of 3
16. (op_3 obj_02 obj_06)
   deleted: (pred_1 obj_02 obj_06) (pred_4)
   added: (pred_6 obj_02)
   goals met: 2 of 3
17. (op_1 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 2 of 3
18. (op_2 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_1 obj_02 obj_05) (pred_4)
   goals met: 3 of 3
